week_3/quiz_crt.tex
% Created 2024-06-26 Wed 14:16
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper,left=1cm,right=1cm,top=1cm,bottom=1cm]{geometry}
\usepackage[american, english]{babel}
\usepackage{enumitem}
\usepackage{float}
\usepackage[sc]{mathpazo}
\linespread{1.05}
\renewcommand{\labelitemi}{$\rhd$}
\setlength\parindent{0pt}
\setlist[itemize]{leftmargin=*}
\setlist{nosep}
\newcommand{\Mod}{\mathrm{mod}\:}
\author{Marcio Woitek}
\date{}
\title{Chinese Remainder Theorem}
\hypersetup{
 pdfauthor={Marcio Woitek},
 pdftitle={Chinese Remainder Theorem},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.8)}, 
 pdflang={English}}
\begin{document}

\maketitle
\thispagestyle{empty}
\pagestyle{empty}
\section*{Problem 1}
\label{sec:org5e7123d}
\textbf{Answer:} \(N=5\cdot 7\cdot 8\cdot 9=2520\)
\section*{Problem 2}
\label{sec:orgfb1c2f3}
\textbf{Answer:} \((0,4,1,6)\)\\

In this case, \(X=12345\). It's simple to verify that
\begin{align}
X\:\Mod 5&=0,\\
X\:\Mod 7&=4,\\
X\:\Mod 8&=1,\\
X\:\Mod 9&=6.
\end{align}
Therefore, the CRT representation of \(X\) is \((0,4,1,6)\).
\section*{Problem 3}
\label{sec:orgc92313a}
\textbf{Answer:} It is divisible by both 5 and 8, but may be divisible by other prime
factors as well.\\

To be sure, let's derive the congruence relation that this integer must satisfy.
In this case, the moduli are \(M_1=5\), \(M_2=7\), \(M_3=8\) and \(M_4=9\).
It's straightforward to compute the corresponding coefficients \(A_i\).
They're given by
\begin{align}
A_1&=2016,\\
A_2&=1800,\\
A_3&=945,\\
A_4&=280.
\end{align}
Then \(X\) satisfies
\begin{equation}
X\equiv A_1 R_1+A_2 R_2+A_3 R_3+A_4 R_4\equiv 2016\,R_1+1800\,R_2+945\,R_3+280\,R_4\quad(\Mod 2520).
\end{equation}
Next, we use the CRT representation of \(X\). By substituting the values of
\(R_i\) into the last formula, we get
\begin{equation}
X\equiv 480\quad(\Mod 2520).
\end{equation}
For concreteness, let's assume that \(X=480\). One can easily check the
following facts about this number:
\begin{itemize}
\item it is divisible by 5;
\item it is divisible by 8;
\item it is divisible by 40;
\item since it is clearly even, it is also divisible by 2.
\end{itemize}
These facts allow us to exclude three of the options. The only remaining option
must be the correct one.
\section*{Problem 4}
\label{sec:orgfbd5603}
\textbf{Answer:} \((9,16,35)\)\\

This is the only option such that the product of the moduli equals 5040, and the
moduli are pair-wise coprime.
\section*{Problem 5}
\label{sec:org090a20b}
\textbf{Answer:} 10\\

It's straightforward to show that, for these moduli, the congruence relation
that \(X\) must satisfy can be written as
\begin{equation}
X\equiv 15\,R_1+10\,R_2+6\,R_3\quad(\Mod 30),
\end{equation}
where \(R_1\), \(R_2\) and \(R_3\) are the residues corresponding to the
moduli 2, 3 and 5, respectively.
\section*{Problem 6}
\label{sec:orgdac7e26}
\textbf{Answer:} 4\\

It's straightforward to show that, for these moduli, the congruence relation
that \(X\) must satisfy can be written as
\begin{equation}
X\equiv 288\,R_1+441\,R_2+280\,R_3\quad(\Mod 504),
\end{equation}
where \(R_1\), \(R_2\) and \(R_3\) are the residues corresponding to the
moduli 7, 8 and 9, respectively. By substituting the values of these residues
into the above expression, we obtain
\begin{equation}
X\equiv 4\quad(\Mod 504).
\end{equation}
\section*{Problem 7}
\label{sec:orgea05915}
\textbf{Answer:} \((5,7,3)\)\\

For these moduli, the CRT representation of 12345 is \((4,1,6)\). The integer
82734 is represented by \((1,6,6)\). Then the representation of the sum of
these numbers is
\begin{equation}
((4+1)\:\Mod 7,(1+6)\:\Mod 8,(6+6)\:\Mod 9)=(5,7,3).
\end{equation}
\section*{Problem 8}
\label{sec:orgb6fc81b}
\textbf{Answer:} \((4,6,0)\)\\

For these moduli, the CRT representation of 12345 is \((4,1,6)\). The integer
82734 is represented by \((1,6,6)\). Then the representation of the product of
these numbers is
\begin{equation}
((4\cdot 1)\:\Mod 7,(1\cdot 6)\:\Mod 8,(6\cdot 6)\:\Mod 9)=(4,6,0).
\end{equation}
\section*{Problem 9}
\label{sec:org31b7cfc}
\textbf{Answer:} \((5,5,1)\)\\

For these moduli, the CRT representation of 46189 is \((3,5,1)\). It's simple
to check that the following is true:
\begin{itemize}
\item 5 is the multiplicative inverse of 3 modulo 7;
\item 5 is the multiplicative inverse of 5 modulo 8;
\item 1 is the multiplicative inverse of 1 modulo 9.
\end{itemize}
Therefore, the multiplicative inverse of 46189 is represented by \((5,5,1)\).
\section*{Problem 10}
\label{sec:orgb9fd7ea}
\textbf{Answer:} \((2,1,0)\)\\

We already know that, for these moduli, 12345 is represented by \((4,1,6)\).
Then the representation of its fifth power can be computed as follows:
\begin{equation}
(4^5\:\Mod 7,1^5\:\Mod 8,6^5\:\Mod 9)=(2,1,0).
\end{equation}
\end{document}
